In [3]:
import numpy as np
import pandas as pd

In [11]:
university_towns = []
with open('C://Users//vipatha//02_ScientificStack_0719//data/university_towns.txt') as file:
    for i in file:
        if '[edit]' in i:
            state = i
        else:
            university_towns.append((state, i))
university_towns[0:10]

[('Alabama[edit]\n', 'Auburn (Auburn University)[1]\n'),
 ('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n'),
 ('Alabama[edit]\n', 'Livingston (University of West Alabama)[2]\n'),
 ('Alabama[edit]\n', 'Montevallo (University of Montevallo)[2]\n'),
 ('Alabama[edit]\n', 'Troy (Troy University)[2]\n'),
 ('Alabama[edit]\n',
  'Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]\n'),
 ('Alabama[edit]\n', 'Tuskegee (Tuskegee University)[5]\n'),
 ('Alaska[edit]\n', 'Fairbanks (University of Alaska Fairbanks)[2]\n'),
 ('Arizona[edit]\n', 'Flagstaff (Northern Arizona University)[6]\n')]

In [12]:
towns_df = pd.DataFrame(university_towns, columns=['State', 'RegionName'])
towns_df.head(20)

               State                                         RegionName
0    Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1    Alabama[edit]\n           Florence (University of North Alabama)\n
2    Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3    Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4    Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n
5    Alabama[edit]\n                        Troy (Troy University)[2]\n
6    Alabama[edit]\n  Tuscaloosa (University of Alabama, Stillman Co...
7    Alabama[edit]\n                Tuskegee (Tuskegee University)[5]\n
8     Alaska[edit]\n    Fairbanks (University of Alaska Fairbanks)[2]\n
9    Arizona[edit]\n       Flagstaff (Northern Arizona University)[6]\n
10   Arizona[edit]\n                 Tempe (Arizona State University)\n
11   Arizona[edit]\n                   Tucson (University of Arizona)\n
12  Arkansas[edit]\n  Arkadelphia (Henderson State University, Ouach...
13  Arkansas[edit]\n  Conway (Central Baptist College, Hendrix Colle...
14  Arkansas[edit]\n         Fayetteville (University of Arkansas)[7]\n
15  Arkansas[edit]\n         Jonesboro (Arkansas State University)[8]\n
16  Arkansas[edit]\n       Magnolia (Southern Arkansas University)[2]\n
17  Arkansas[edit]\n  Monticello (University of Arkansas at Monticel...
18  Arkansas[edit]\n       Russellville (Arkansas Tech University)[2]\n
19  Arkansas[edit]\n                   Searcy (Harding University)[5]\n

In [14]:
towns_df['State'] = towns_df['State'].str.split("[", expand=True)
towns_df['State'].head(10)

0    Alabama
1    Alabama
2    Alabama
3    Alabama
4    Alabama
5    Alabama
6    Alabama
7    Alabama
8     Alaska
9    Arizona
Name: State, dtype: object

In [15]:
towns_df.head(5)

     State                                         RegionName
0  Alabama                    Auburn (Auburn University)[1]\n
1  Alabama           Florence (University of North Alabama)\n
2  Alabama  Jacksonville (Jacksonville State University)[2]\n
3  Alabama       Livingston (University of West Alabama)[2]\n
4  Alabama         Montevallo (University of Montevallo)[2]\n

In [20]:
towns_df[['City','University','1','2']] = towns_df['RegionName'].str.split("(", expand=True)
towns_df.head(5)

,State,RegionName,City,University,1,2
0,Alabama,Auburn (Auburn University)[1]\n,Auburn,Auburn University)[1]\n,None,None
1,Alabama,Florence (University of North Alabama)\n,Florence,University of North Alabama)\n,None,None
2,Alabama,Jacksonville (Jacksonville State University)[2]\n,Jacksonville,Jacksonville State University)[2]\n,None,None
3,Alabama,Livingston (University of West Alabama)[2]\n,Livingston,University of West Alabama)[2]\n,None,None
4,Alabama,Montevallo (University of Montevallo)[2]\n,Montevallo,University of Montevallo)[2]\n,None,None

In [21]:
to_drop = ['RegionName','1','2']
towns_df = towns_df.drop(to_drop,axis=1)
towns_df.head(5)

     State           City                           University
0  Alabama        Auburn               Auburn University)[1]\n
1  Alabama      Florence        University of North Alabama)\n
2  Alabama  Jacksonville   Jacksonville State University)[2]\n
3  Alabama    Livingston      University of West Alabama)[2]\n
4  Alabama    Montevallo        University of Montevallo)[2]\n

In [23]:
#towns_df['University'].str.split(')', expand = True)
towns_df[['University_Name', 'drop']] = towns_df['University'].str.split(')', expand = True)

In [29]:
towns_df.head(5)

,State,City,University,University_Name
0,Alabama,Auburn,Auburn University)[1]\n,Auburn University
1,Alabama,Florence,University of North Alabama)\n,University of North Alabama
2,Alabama,Jacksonville,Jacksonville State University)[2]\n,Jacksonville State University
3,Alabama,Livingston,University of West Alabama)[2]\n,University of West Alabama
4,Alabama,Montevallo,University of Montevallo)[2]\n,University of Montevallo

In [31]:
towns_df.drop(['University'], axis=1,inplace=True)
towns_df.head(5)

     State           City                University_Name
0  Alabama        Auburn               Auburn University
1  Alabama      Florence     University of North Alabama
2  Alabama  Jacksonville   Jacksonville State University
3  Alabama    Livingston      University of West Alabama
4  Alabama    Montevallo        University of Montevallo

In [34]:
#towns_df['State'] == 'Utah'
print(towns_df.loc[towns_df['State'] == 'Utah'])

    State             City           University_Name
465  Utah      Cedar City   Southern Utah University
466  Utah           Logan      Utah State University
467  Utah           Provo   Brigham Young University
468  Utah            Orem     Utah Valley University
469  Utah  Salt Lake City         University of Utah
470  Utah         Ephraim               Snow College

In [36]:
print(towns_df.loc[towns_df['State'] == 'Washington'])

          State                           City                University_Name
489  Washington                    Bellingham   Western Washington University
490  Washington                        Cheney   Eastern Washington University
491  Washington                    Ellensburg   Central Washington University
492  Washington                       Pullman     Washington State University
493  Washington  University District, Seattle        University of Washington

In [37]:
print(towns_df.loc[towns_df['State'] == 'Hawaii'])

     State    City                University_Name
91  Hawaii  Manoa   University of Hawaii at Manoa